Brannflakess/CMPE_146_Project/STM32/Core/Src/main.c
#include "main.h"
/* USER CODE BEGIN Includes */
#include <string.h>
#include <stdio.h>
#include <stdlib.h>
#include <stdint.h>
#include "oled_ssd1306.h"
/* Ensure device/CMSIS headers are available via project include paths */
#include "stm32f4xx.h"
#include "stm32f401xe.h"
#include "stm32f4xx_hal_flash_ex.h"

/* Fallback for IntelliSense: define FLASH_LATENCY_0 if HAL headers were not processed */
#ifndef FLASH_LATENCY_0
#define FLASH_LATENCY_0 0
#endif
/* USER CODE END Includes */

/* Private variables ---------------------------------------------------------*/
I2C_HandleTypeDef hi2c1;
UART_HandleTypeDef huart1;
UART_HandleTypeDef huart2;

/* USER CODE BEGIN PV */
/* MPU-6050 definitions ------------------------------------------------------*/
#define MPU6050_ADDR (0x68 << 1)
#define MPU6050_REG_WHO_AM_I 0x75
#define MPU6050_REG_PWR_MGMT_1 0x6B
#define MPU6050_REG_ACCEL_XOUT_H 0x3B

/* General settings ----------------------------------------------------------*/
#define FILTER_SIZE 5
#define SAMPLE_DELAY_MS 80
#define MODE_LOCK_MS 600
#define ESP32_TX_PERIOD_MS 100

/* -------------------------------------------------------------------------- */
/* EXERCISE MODE DETECTION                                                    */
/* -------------------------------------------------------------------------- */
/*
 * Assumption for chest-mounted vertical board:
 *
 * - Standing upright for squats:
 *     |AY| tends to be large (near 1g), while |AZ| is smaller
 *
 * - Horizontal body position for push-ups:
 *     |AZ| tends to be large (near 1g), while |AY| is smaller
 *
 * These values are placeholders and should be tuned from real logs.
 */
#define MODE_GRAVITY_HIGH 13000
#define MODE_GRAVITY_LOW 9000

typedef enum
{
    EXERCISE_UNKNOWN = 0,
    EXERCISE_SQUAT,
    EXERCISE_PUSHUP
} ExerciseMode;

/* -------------------------------------------------------------------------- */
/* SQUAT SETTINGS                                                             */
/* -------------------------------------------------------------------------- */
#define SQUAT_REP_LOCKOUT_MS 1200
/* Legacy absolute thresholds (reserved / tuning reference; squat FSM uses deltas below). */
#define SQUAT_STAND_THRESHOLD 16000
#define SQUAT_DOWN_THRESHOLD 13500
#define SQUAT_BOTTOM_THRESHOLD 12000
#define SQUAT_UP_THRESHOLD 13500

/* Range/delta-based thresholds (filtered AY units — tuned from Putty squat log, May 2026). */
#define SQUAT_DOWN_DELTA 1200      /* start descent; log showed ~3.2k–3.5k once moving */
#define SQUAT_BOTTOM_DELTA 1800    /* reach bottom; successful rep hit ~3.2k before BOTTOM */
#define SQUAT_MIN_ROM 900          /* min peak-to-peak; logged rep ROM ~5100 */
#define MIN_STATE_HOLD 2
/* GOING_DOWN abort: log had false "abort" when delta briefly dipped vs DOWN_DELTA/2 (=700); use a tighter floor */
#define SQUAT_DOWN_ABORT_DELTA 380

typedef enum
{
    SQUAT_STATE_STANDING = 0,
    SQUAT_STATE_GOING_DOWN,
    SQUAT_STATE_BOTTOM,
    SQUAT_STATE_GOING_UP
} SquatState;

/* -------------------------------------------------------------------------- */
/* PUSH-UP SETTINGS                                                           */
/* -------------------------------------------------------------------------- */
#define PUSHUP_REP_LOCKOUT_MS 900

#define PUSHUP_TOP_THRESHOLD -16500
#define PUSHUP_DOWN_THRESHOLD -15500
#define PUSHUP_BOTTOM_THRESHOLD -14200
#define PUSHUP_UP_THRESHOLD -15200

typedef enum
{
    PUSHUP_STATE_TOP = 0,
    PUSHUP_STATE_GOING_DOWN,
    PUSHUP_STATE_BOTTOM,
    PUSHUP_STATE_GOING_UP
} PushupState;

/* -------------------------------------------------------------------------- */
/* MOVING AVERAGE FILTER                                                      */
/* -------------------------------------------------------------------------- */
typedef struct
{
    int buffer[FILTER_SIZE];
    int index;
    int sum;
    uint8_t filled;
} MovingAverageFilter;

/* Global state --------------------------------------------------------------*/
static ExerciseMode current_mode = EXERCISE_UNKNOWN;
static ExerciseMode candidate_mode = EXERCISE_UNKNOWN;
static uint32_t candidate_mode_start = 0;

static SquatState squat_state = SQUAT_STATE_STANDING;
static uint32_t squat_count = 0;
static uint32_t squat_last_rep_time = 0;
static float squat_baseline_ay = 0.0f;
static uint8_t squat_baseline_init = 0;
static uint8_t squat_state_hold_count = 0;
static float squat_min_ay = 99999.0f;

static PushupState pushup_state = PUSHUP_STATE_TOP;
static uint32_t pushup_count = 0;
static uint32_t pushup_last_rep_time = 0;

static MovingAverageFilter squat_filter = {0};
static MovingAverageFilter pushup_filter = {0};

static uint32_t last_oled_update = 0;
static uint32_t last_esp32_tx = 0;

/* Monotonic per boot: new value after reset or power cycle (used as Firebase session key). */
static uint32_t g_session_id = 0;

/* I2C: consecutive MPU read failures before bus/controller recovery */
static uint8_t i2c_accel_fail_streak = 0;
/* USER CODE END PV */

/* Private function prototypes -----------------------------------------------*/
void SystemClock_Config(void);
void OLED_UpdateScreen(void);
static void MX_GPIO_Init(void);
static void MX_I2C1_Init(void);
static void MX_USART1_UART_Init(void);
static void MX_USART2_UART_Init(void);

/* USER CODE BEGIN PFP */
HAL_StatusTypeDef MPU6050_Init(void);
HAL_StatusTypeDef MPU6050_ReadAccelRaw(int16_t *ax, int16_t *ay, int16_t *az);

int MovingAverage_Update(MovingAverageFilter *f, int new_value);
void MovingAverage_Reset(MovingAverageFilter *f);

ExerciseMode Detect_ExerciseMode(int16_t ax, int16_t ay, int16_t az);
void Update_Mode_Lock(ExerciseMode detected_mode, uint32_t now_ms);

void Squat_Update(int value, uint32_t now_ms);
void Pushup_Update(int value, uint32_t now_ms);

const char *ExerciseMode_ToString(ExerciseMode mode);
const char *SquatState_ToString(SquatState state);
const char *PushupState_ToString(PushupState state);
HAL_StatusTypeDef UART1_SendString(const char *msg);
HAL_StatusTypeDef ESP32_SendTelemetry(int16_t ax,
                                      int16_t ay,
                                      int16_t az,
                                      int raw_axis,
                                      int filtered_axis,
                                      const char *state_string,
                                      uint32_t now_ms);
static void SessionId_InitAtBoot(void);
static void RecoverI2C1_AfterBusError(void);
/* USER CODE END PFP */

/* USER CODE BEGIN 0 */
/* Redirect printf to UART ---------------------------------------------------*/
int __io_putchar(int ch)
{
    HAL_UART_Transmit(&huart2, (uint8_t *)&ch, 1, HAL_MAX_DELAY);
    return ch;
}

HAL_StatusTypeDef UART1_SendString(const char *msg)
{
    size_t len = strlen(msg);
    if (len == 0U)
    {
        return HAL_OK;
    }
    return HAL_UART_Transmit(&huart1, (uint8_t *)msg, (uint16_t)len, 100);
}

static void RecoverI2C1_AfterBusError(void)
{
    (void)HAL_I2C_DeInit(&hi2c1);
    HAL_Delay(5);
    MX_I2C1_Init();
    printf("I2C1 bus recovery (DeInit + MX_I2C1_Init)\r\n");
}

static void SessionId_InitAtBoot(void)
{
    /* DWT cycle counter + SysTick vary each reset/power-on; HAL_GetTick() is often ~0 here
     * if called early — mixing avoids repeating the same session_id after unplug/replug. */
    CoreDebug->DEMCR |= CoreDebug_DEMCR_TRCENA_Msk;
    DWT->CYCCNT = 0U;
    DWT->CTRL |= DWT_CTRL_CYCCNTENA_Msk;

