Brannflakess/CMPE_146_Project/STM32/Core/Src/main.c
            /* Reset filters and per-exercise state when switching modes */
            MovingAverage_Reset(&squat_filter);
            MovingAverage_Reset(&pushup_filter);

            squat_state = SQUAT_STATE_STANDING;
            pushup_state = PUSHUP_STATE_TOP;

            printf("MODE -> %s\r\n", ExerciseMode_ToString(current_mode));
        }
    }
}

/* -------------------------------------------------------------------------- */
/* SQUAT LOGIC                                                                */
/* -------------------------------------------------------------------------- */
void Squat_Update(int value, uint32_t now_ms)
{
    float fvalue = (float)value;
    float delta = 0.0f;

    /* Initialize baseline while standing */
    if (!squat_baseline_init && (squat_state == SQUAT_STATE_STANDING))
    {
        squat_baseline_ay = fvalue;
        squat_baseline_init = 1;
    }

    if (squat_baseline_init)
    {
        /* when standing, slowly track baseline to adapt to drift */
        if (squat_state == SQUAT_STATE_STANDING)
        {
            squat_baseline_ay = (0.95f * squat_baseline_ay) + (0.05f * fvalue);
        }

        delta = squat_baseline_ay - fvalue; /* positive when chest moves down */
    }

    switch (squat_state)
    {
    case SQUAT_STATE_STANDING:
        if (squat_baseline_init && (delta >= SQUAT_DOWN_DELTA))
        {
            squat_state_hold_count++;
            if (squat_state_hold_count >= MIN_STATE_HOLD)
            {
                squat_state = SQUAT_STATE_GOING_DOWN;
                squat_state_hold_count = 0;
                squat_min_ay = fvalue;
                printf("SQUAT STATE -> GOING_DOWN (delta=%.0f)\r\n", delta);
            }
        }
        else
        {
            squat_state_hold_count = 0;
        }
        break;

    case SQUAT_STATE_GOING_DOWN:
        /* track minimum AY while descending */
        if (fvalue < squat_min_ay)
            squat_min_ay = fvalue;
        if (squat_baseline_init && (delta >= SQUAT_BOTTOM_DELTA))
        {
            squat_state_hold_count++;
            if (squat_state_hold_count >= MIN_STATE_HOLD)
            {
                squat_state = SQUAT_STATE_BOTTOM;
                squat_state_hold_count = 0;
                printf("SQUAT STATE -> BOTTOM (delta=%.0f)\r\n", delta);
            }
        }
        else if (squat_baseline_init && (delta < (float)SQUAT_DOWN_ABORT_DELTA))
        {
            /* aborted descent */
            squat_state = SQUAT_STATE_STANDING;
            squat_state_hold_count = 0;
            squat_min_ay = 99999.0f;
            printf("SQUAT STATE -> STANDING (abort)\r\n");
        }
        break;

    case SQUAT_STATE_BOTTOM:
        if (squat_baseline_init && (delta < (SQUAT_BOTTOM_DELTA / 2.0f)))
        {
            squat_state_hold_count++;
            if (squat_state_hold_count >= MIN_STATE_HOLD)
            {
                squat_state = SQUAT_STATE_GOING_UP;
                squat_state_hold_count = 0;
                printf("SQUAT STATE -> GOING_UP\r\n");
            }
        }
        else
        {
            squat_state_hold_count = 0;
        }
        break;

    case SQUAT_STATE_GOING_UP:
        if (squat_baseline_init && (delta <= (SQUAT_DOWN_DELTA / 2.0f)))
        {
            /* compute ROM and decide whether to count */
            float rom = squat_baseline_ay - squat_min_ay;
            if ((now_ms - squat_last_rep_time) > SQUAT_REP_LOCKOUT_MS)
            {
                if (rom >= SQUAT_MIN_ROM)
                {
                    squat_count++;
                    squat_last_rep_time = now_ms;
                    printf("SQUAT COUNT = %lu (rom=%.0f)\r\n", (unsigned long)squat_count, rom);
                }
                else
                {
                    printf("SQUAT REP REJECTED (rom=%.0f min=%d)\r\n", rom, SQUAT_MIN_ROM);
                }
            }

            squat_state = SQUAT_STATE_STANDING;
            squat_min_ay = 99999.0f;
            squat_state_hold_count = 0;
            printf("SQUAT STATE -> STANDING\r\n");
        }
        break;

    default:
        squat_state = SQUAT_STATE_STANDING;
        squat_state_hold_count = 0;
        break;
    }
}

/* -------------------------------------------------------------------------- */
/* PUSH-UP LOGIC                                                              */
/* -------------------------------------------------------------------------- */
void Pushup_Update(int value, uint32_t now_ms)
{
    switch (pushup_state)
    {
    case PUSHUP_STATE_TOP:
        /* Going down = value becomes LESS negative */
        if (value > PUSHUP_DOWN_THRESHOLD)
        {
            pushup_state = PUSHUP_STATE_GOING_DOWN;
            printf("PUSHUP STATE -> GOING_DOWN\r\n");
        }
        break;

    case PUSHUP_STATE_GOING_DOWN:
        if (value > PUSHUP_BOTTOM_THRESHOLD)
        {
            pushup_state = PUSHUP_STATE_BOTTOM;
            printf("PUSHUP STATE -> BOTTOM\r\n");
        }
        else if (value < PUSHUP_TOP_THRESHOLD)
        {
            /* Went back to top too early */
            pushup_state = PUSHUP_STATE_TOP;
            printf("PUSHUP STATE -> TOP (reset)\r\n");
        }
        break;

    case PUSHUP_STATE_BOTTOM:
        /* Going up = value becomes MORE negative again */
        if (value < PUSHUP_UP_THRESHOLD)
        {
            pushup_state = PUSHUP_STATE_GOING_UP;
            printf("PUSHUP STATE -> GOING_UP\r\n");
        }
        break;

    case PUSHUP_STATE_GOING_UP:
        if (value < PUSHUP_TOP_THRESHOLD)
        {
            if ((now_ms - pushup_last_rep_time) > PUSHUP_REP_LOCKOUT_MS)
            {
                pushup_count++;
                pushup_last_rep_time = now_ms;
                printf("PUSHUP COUNT = %lu\r\n", (unsigned long)pushup_count);
            }

            pushup_state = PUSHUP_STATE_TOP;
            printf("PUSHUP STATE -> TOP\r\n");
        }
        break;

    default:
        pushup_state = PUSHUP_STATE_TOP;
        break;
    }
}

